package AnimalChess;

public class My_map {
	/**
	 * ÊÖ¹¤µØÍ¼
	 * 1-ºÚÊó  2-ºÚÃ¨  3-ºÚ¹·  4-ºÚÀÇ  5-ºÚ±ª  6-ºÚ»¢  7-ºÚÊ¨  8-ºÚÏó  9-ºÚÏİÚå  10-ºÚ³²Ñ¨
	 * -1ºìÊó  -2ºìÃ¨  -3ºì¹·  -4ºìÀÇ  -5ºì±ª  -6ºì»¢  -7ºìÊ¨  -8ºìÏó  -9ºìÏİÚå  -10ºì³²Ñ¨
	 * 0-¿ÕµØ
	 * 11-Ğ¡ºÓ
	 */
	public static int[][] map;
	
	public My_map() {
		map = new int[][] {
			{7, 0, 9, 10, 9, 0, 6},
			{0, 3, 0, 9, 0, 2, 0},
			{1, 0, 5, 0, 4, 0, 8},
			{0, 11, 11, 0, 11, 11, 0},
			{0, 11, 11, 0, 11, 11, 0},
			{0, 11, 11, 0, 11, 11, 0},
			{-8, 0, -4, 0, -5, 0, -1},
			{0, -2, 0, -9, 0, -3, 0},
			{-6, 0, -9, -10, -9, 0, -7}
		};
	}
}
